var quotesa = [
{eauthor:'',quot:'Электрический ток - явление опасное и до конца не изученное.'},
{eauthor:'',quot:'Техника безопасности - Это религия, в которую можно не верить, но обряды нужно соблюдать.'},
{eauthor:'',quot:'Любая маленькая работа начинается с большого перекура.'},
{eauthor:'',quot:'Плохой электрик знает в лицо всех архангелов.'},
{eauthor:'',quot:'Если напряжение можно понять умом, то ток только чувством!'},
{eauthor:'',quot:'Молодой электрик не умеет работать, а старый умеет не работать.'},
{eauthor:'',quot:'Бесплатная электроэнергия бывает только в электрическом стуле.'},
{eauthor:'',quot:'Грязные контакты - основная причина преждевременного выхода из строя людей и электроприборов.'},
{eauthor:'',quot:'Если удалось собрать с первого раза электросхему, постарайтесь скрыть удивление.'},
{eauthor:'',quot:'Никакая защита от дурака для талантливого дурака не помеха.'},
{eauthor:'',quot:'Если вы спокойны, а вокруг вас в панике с криками бегают люди - возможно, вы что-то не поняли.'},
{eauthor:'',quot:'Здоровый сон не только продлевает жизнь, но и сокращает рабочий день.'},
{eauthor:'',quot:'Провода в какой-то степени очень напоминают женские ноги - чем больше оголены, тем больше вариантов лечь после прикосновения.'},
{eauthor:'',quot:'В электрике, как и в футболе, у нас разбирается каждый.'},
{eauthor:'',quot:'Не знаешь закон Ома - сиди дома.'},
{eauthor:'',quot:'В электричестве всего две неисправности: 1. Нет контакта там где он нужен и 2. Есть контакт там где он не нужен.'},
{eauthor:'',quot:'Не стоит трогать руками хорошо налаженный механизм.'},
{eauthor:'',quot:'Предохранитель всегда сгорает последним.'},
{eauthor:'',quot:'Любое устройство, требующее наладки и регулировки, обычно не поддается ни тому, ни другому.'},
{eauthor:'',quot:'Одинаковые приборы, проверенные одинаковым способом, будут в эксплуатации вести себя совершенно по-разному.'},
{eauthor:'',quot:'Если не замкнет, значит заработает.'},
{eauthor:'',quot:'Врубай, лишнее отгорит.'},
{eauthor:'',quot:'Хороший стук всегда вылезет наружу.'},
{eauthor:'',quot:'Шуруп, забитый молотком, сидит крепче, чем гвоздь закрученный отверткой.'},
{eauthor:'',quot:'Если при сборке электросхемы все заработало с первого раза, вырубай быстрее и ищи ошибку.'},
{eauthor:'',quot:'Если ничто другое не помогает, прочтите наконец инструкцию.'},
{eauthor:'',quot:'Работа электрика и работа шамана имеют много общего: например, оба произносят непонятные слова, совершают непонятные действия и не могут объяснить, как это все работает.'},
{eauthor:'',quot:'Переменный ток - это такой ток, который нет-нет да ка-а-к долбанет.'},
{eauthor:'',quot:'Постоянный ток бьет только один раз, а переменный 50 раз.'},
{eauthor:'',quot:'Электричество, это просто - Не суй руки - не протянешь ноги.'},
{eauthor:'',quot:'Сапер и электрик ошибаются только один раз, но электрик перед смертью еще и танцует.'},
{eauthor:'',quot:'Электрик от плоскогубцев недалеко падает.'},
{eauthor:'',quot:'Не трогай оголенные провода мокрыми руками, от этого они ржавеют и портятся.'},
{eauthor:'',quot:'У электриков один закон - или на щите, или под щитом.'},
{eauthor:'',quot:'Для хорошего электрика не существует такого короткого замыкания, которое он не смог бы удлинить.'},
{eauthor:'',quot:'Если Вы стучите в дверь, а Вам никто не открывает. А за дверью слышен гул, то: 1 - Там гудят без Вас и 2 - Эта дверь в Трансформаторную.'},
{eauthor:'',quot:'Если взяться одной рукой за один оголенный провод, а другой рукой за другой оголенный провод, то вы поймете отчего загорается лампочка.'},
{eauthor:'',quot:'Опытный электрик даже женщину не берет за две груди одновременно.'},
{eauthor:'',quot:'Все беды электриков от плохих контактов.'},
{eauthor:'',quot:'Большинство электрических приборов потребляют меньше электричества в выключенном состоянии.'},
{eauthor:'',quot:'Совет молодому электрику: - Если ваши руки в диэлектрических перчатках, то неважно откуда они растут.'},
{eauthor:'',quot:'Если страуса пугать с частотой 50Гц, то получится неплохой отбойный молоток.'},
{eauthor:'',quot:'Каждый раз,открывая где-нибудь распределительную коробку, можно вновь и вновь убедиться,что в нашей стране электрики - люди творческие.'},
{eauthor:'',quot:'Нет постояннее соединения, чем временная скрутка.'},
{eauthor:'',quot:'У электриков опыт растет прямо пропорционально выведенному из строя электрооборудованию.'},
{eauthor:'',quot:'На всякое напряжение найдется своя закоротка.'},
{eauthor:'',quot:'Смелый электрик до пенсии не доживает.'},
{eauthor:'',quot:'Плохое масло испортит не только кашу, но и трансформатор.'},
{eauthor:'',quot:'Не главное - докопаться до истины, главное - проводки не перепутать.'},
{eauthor:'',quot:'Если вы ошиблись,то автомат нас поправит.'},
{eauthor:'',quot:'Кабель - как парашют - лучше всегда иметь запасной.'},
{eauthor:'',quot:'Если подойти к спящему электрику и изо всей силы гаркнуть ему на ухо Двести двадцать! - то он тут же подскочит и может убить за это. Это ещё раз доказывает, что 220 опасно для жизни.'},
{eauthor:'',quot:'Надпись Не влезай, убьёт!, понимаемая на всех языках мира буквально, для нашего человека означает просто: Ты поосторожней там, когда влезешь.'},
{eauthor:'',quot:'Сколько всего нового и неизведанного может открыть для себя человек, попавший под напряжение.'},
{eauthor:'',quot:'Сила искр из глаз электрика прямо пропорциональна току, прошедшему через него, и обратно пропорциональна количеству алкоголя в его крови.'},
{eauthor:'',quot:'Ток, который нас не убивает, делает нас осторожнее.'},
{eauthor:'',quot:'Рубильник – орудие шантажа электриков.'},
{eauthor:'',quot:'Постоянное напряжение, будет не таким постоянным, если в проводку добавить две-три скрутки алюминия с медью.'},
{eauthor:'',quot:'Основное правило техники безопасности: Не работай - не пострадаешь!'},
{eauthor:'',quot:'Опыт - это когда перед тем, как очередной раз включить рубильник, ты прикрываешь глаза рукой.'},
{eauthor:'',quot:'На жизнь надо смотреть позитивно. Например, если вас долбануло постоянным током, то в этом есть не только минус, но и плюс.'},
{eauthor:'',quot:'Вот интересно, в каких единицах Ампер измерял силу тока, Вольт - напряжение, а Ньютон - силу?'},
{eauthor:'',quot:'В ходе проверки счётчиков электроэнергии выяснилось, что некоторые граждане не только совсем не потребляют электричество, а даже производят его и совершенно бесплатно заливают его в городскую электросеть.'},
{eauthor:'',quot:'Если верить пробнику, то в розетках, обычно, два ноля.'},
{eauthor:'',quot:'Фаза в общем-то полезная, но на ощупь неприятная.'},
{eauthor:'',quot:'По лысому электрику не понятно, когда он ошибается.'},
{eauthor:'',quot:'Если сантехник плохо свое дело сделал - воняет, если электрик - убивает.'},
{eauthor:'',quot:'Горячий паяльник выглядит точно так же, как и холодный.'},
{eauthor:'',quot:'Семь раз замерь, один раз замкни.'},
{eauthor:'',quot:'В наборе инструментов обычно не хватает именно того гаечного ключа, который нужен.'},
{eauthor:'',quot:'Для выполнения большинства операций требуется три руки.'},
{eauthor:'',quot:'Каждому электрику известно: вещь, обмотанная синей изолентой, будет служить вечно.'},
{eauthor:'',quot:'Электрики делятся не на умных и дураков, а на молодых и старых.'}
];

function randomQuoteQu() {
var randomButtone = document.querySelector("button.random-equote");
var quoteTextEle = document.querySelector(".electrik-text");
var authorEle = document.querySelector(".electrik-author");

newRandomQuoteAA(quotesa, quoteTextEle, authorEle);

randomButtone.addEventListener("click", function() {
newRandomQuoteAA(quotesa, quoteTextEle, authorEle);
});

}

function newRandomQuoteAA(quoteaArray, quoteElemente, authorElemente) {
var newQuote = quoteaArray[randomGen(0, quotesa.length - 1)];
quoteElemente.innerText = newQuote.quot;
authorElemente.innerText = "-- " + newQuote.eauthor;
}

function randomGen(min, max) {
return Math.floor(Math.random() * (max - min + 1) + min);
}
randomQuoteQu();